app/views/articles/new.html.erb

                <%= f.label :category %><br />
                <%= f.select :category_id, Category.all.collect{|c|[c.name, c.id]}, autofocus: true, class: "form-control", prompt: "Choose your Category" %><br />
---
SELECT "categories".* FROM "categories"