app/views/articles/show.html.erb

        <% end %>
        <% if !current_user.voted_articles.ids.include?(@article.id) %>
            <span> <%= @article.votes.count %> Votes </span>
---
SELECT "votes"."id" FROM "votes" WHERE "votes"."user_id" = $1  [["user_id", 7]]
SELECT "articles"."id" FROM "articles" INNER JOIN "votes" ON "articles"."id" = "votes"."article_id" WHERE "votes"."user_id" = $1  [["user_id", 7]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = $1  [["article_id", 9]]

            <i>
                <span> <%= @article.votes.count %> Votes </span><br>
                <%= link_to 'Unvote', vote_path(current_user.votes.ids ), method: :delete %>
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = $1  [["article_id", 7]]
SELECT "votes"."id" FROM "votes" WHERE "votes"."user_id" = $1  [["user_id", 7]]