app/views/articles/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
        <% end %>
        <% pre_like = @article.votes.find { |vote| vote.user_id == current_user.id} %>