app/helpers/articles_helper.rb

SELECT "votes".* FROM "votes" WHERE "votes"."article_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11)
SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = $1  [["article_id", 2]]
---
    def main_article
        Article.includes(:votes).all.max { |a, b| a.votes.count <=> b.votes.count }

SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = $1  [["article_id", 11]]
---
    def count_votes
        main_article.votes.count