app/controllers/articles_controller.rb

  def index
    @articles = Article.all
    @featured = Article.featured_article
    @categories = Category.order(:priority).limit(5).includes(:articles)
---
SELECT  "categories".* FROM "categories" ORDER BY "categories"."priority" ASC LIMIT $1  [["LIMIT", 5]]