app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" IN ($1, $2)  [["category_id", 1], ["category_id", 2]]
---
  def index
    cate = params[:cate]

    @articles = if cate.nil?
                  Article.all

                else
                  Article.where(category_id: cate)

INSERT INTO "articles" ("title", "text", "created_at", "updated_at", "category_id", "author_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "yoooooooo"], ["text", "sdjfisdfisodjfosjdif"], ["created_at", "2021-01-12 09:52:30.032990"], ["updated_at", "2021-01-12 09:52:30.032990"], ["category_id", 1], ["author_id", 1]]
---
  def create
    @user = User.find_by(params[:id])
    @article = @user.articles.build(article_params)
    if @article.save