app/controllers/categories_controller.rb

  def index
    cate = params[:cate]

    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "priority", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Sports"], ["priority", 1], ["created_at", "2020-12-08 06:02:07.481104"], ["updated_at", "2020-12-08 06:02:07.481104"]]