app/controllers/votes_controller.rb

  def create
    if already_liked?
      flash[:notice] = "You can't like more than once"
    else
      @vote = @current_user.votes.new(article_id: params[:article_id])
      if @vote.save
---
INSERT INTO "votes" ("user_id", "article_id", "created_at", "updated_at", "status") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 7], ["article_id", 6], ["created_at", "2020-12-23 07:23:20.347403"], ["updated_at", "2020-12-23 07:23:20.347403"], ["status", true]]

  def destroy
    @vote = Vote.find(params[:id])
    @vote.destroy
---
SELECT  "votes".* FROM "votes" WHERE "votes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "votes" WHERE "votes"."id" = $1  [["id", 1]]

  def find_article
    @article = Article.find(params[:article_id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]