app/controllers/ypages_controller.rb

  def home
    cate = params[:cate]

    @articles = if cate.nil?
                  Article.all

                else
                  Article.where(category_id: cate)

                end
    @categories = Category.all
---
SELECT "articles".* FROM "articles"
SELECT "categories".* FROM "categories"