app/models/article.rb

SELECT  1 AS one FROM "votes" LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) AS count_all, "votes"."article_id" AS votes_article_id FROM "votes" GROUP BY "votes"."article_id"
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
    def self.featured_article
        return unless Vote.any?
        article_id = Vote.group(:article_id).count.max_by { |_k, v| v }.first
        Article.find(article_id)